In [2]:
import pandas as pd
import numpy as np

# Challenge 1
temp=pd.read_csv('/Users/talia/Desktop/Néné/ironhack_labs/DAFT_0410/module_2/Lab_10_Subsetting-and-Descriptive-Statistics/Temp_States.csv')
temp.head()

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444

In [3]:
temp.describe

<bound method NDFrame.describe of          City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000>

In [4]:
temp.loc[temp["State"]=="New York"]

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

In [7]:
print("Average temperature of cities in NY: ", temp.loc[temp["State"]=="New York"].mean());

Average temperature of cities in NY:  Temperature    10.740741
dtype: float64

/var/folders/vf/1n65j1vx36v93w2m9fv4pfyh0000gn/T/ipykernel_9654/3103919390.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  print("Average temperature of cities in NY: ", temp.loc[temp["State"]=="New York"].mean());

In [8]:
temp.loc[(temp["Temperature"] > 15) & (temp["Temperature"] < 20)]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

In [9]:
temp.groupby("State")["Temperature"].mean()

State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741
Name: Temperature, dtype: float64

In [10]:
temp.groupby("State")["Temperature"].std()

State
Connecticut    1.964186
New Jersey     1.571348
New York       8.133404
Name: Temperature, dtype: float64

In [11]:
# Challenge 2

employees = pd.read_csv('/Users/talia/Desktop/Néné/ironhack_labs/DAFT_0410/module_2/Lab_10_Subsetting-and-Descriptive-Statistics/Employees.csv')
employees.head()

  Department Education      Title      Name  Years  Salary
0      Admin    Master  associate     David      4      58
1         IT    Master  associate    Thomas      7      45
2      Admin    Master  associate     Diana     10      52
3      Admin    Master         VP  Manuella     15      33
4      Sales    Master    Analyst     Carla      6      38

In [13]:
print("Average salary: ", employees["Salary"].mean())

Average salary:  73.528

In [14]:
print("Highest salary: ", employees["Salary"].max())

Highest salary:  120

In [15]:
print("Lowest salary: ", employees["Salary"].min())

Lowest salary:  30